init.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:elisp :tangle ./init.el

* use =init.org= to manager =init.el=.
#+begin_src elisp
(defun my/org-babel-tangle-config()
  (when (string-equal
	 (buffer-file-name)
	 (expand-file-name "init.org" user-emacs-directory)
	 )
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook
 'org-mode-hook
 (lambda ()
   (add-hook 'after-save-hook 'my/org-babel-tangle-config)
   ))
#+end_src
  
* straight
Code below is the exact snippet from https://github.com/raxod502/straight.el#getting-started, which is called *bootstrap code*.
#+begin_src elisp
(defvar bootstrap-version)
    (let ((bootstrap-file
           (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
          (bootstrap-version 5))
      (unless (file-exists-p bootstrap-file)
        (with-current-buffer
            (url-retrieve-synchronously
             "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
             'silent 'inhibit-cookies)
          (goto-char (point-max))
          (eval-print-last-sexp)))
      (load bootstrap-file nil 'nomessage))
#+end_src
We have already set the =(setq package-enable-at-startup nil)= in =early-init.el=.

* use-package
#+begin_src elisp
(straight-use-package 'use-package)
#+end_src

* decoration
Controls
#+begin_src elisp
(setq inhibit-startup-message t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
(set-fringe-mode 10)
(toggle-frame-maximized)
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(display-battery-mode t)
#+end_src

Theme
#+begin_src elisp
(straight-use-package 'doom-themes)
(load-theme 'doom-dracula t)
#+end_src

Doom-mode line
#+begin_src elisp
(straight-use-package 'doom-modeline)
(doom-modeline-mode 1)
#+end_src

Chinese Fonts
#+begin_src elisp
(use-package cnfonts
  :straight t
  :custom
  (cnfonts-personal-fontnames
   '(("MesloLGS NF" "JetBrains Mono")
     ()
     ()))
  :config
  (cnfonts-enable)
  )
#+end_src

counsel
#+begin_src elisp
(straight-use-package 'counsel)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "<f1> f") 'counsel-describe-function)
(global-set-key (kbd "<f1> v") 'counsel-describe-variable)
(global-set-key (kbd "<f1> o") 'counsel-describe-symbol)
(global-set-key (kbd "<f1> l") 'counsel-find-library)
(global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
(global-set-key (kbd "<f2> u") 'counsel-unicode-char)
#+end_src

* completion

selectrum
#+begin_src elisp
(straight-use-package 'selectrum)
(selectrum-mode +1)
#+end_src

prescient
#+begin_src elisp
(straight-use-package 'prescient)
(straight-use-package 'selectrum-prescient)
(selectrum-prescient-mode +1)
(prescient-persist-mode +1)
#+end_src

consult
#+begin_src elisp
(use-package consult
  :straight t)
#+end_src

marginalia
#+begin_src elisp
(use-package marginalia
  :straight t
  :init
  (marginalia-mode)
  )
#+end_src

* keyboard shortcuts
Change the behavior of =<home>= and =<end>=.
#+begin_src elisp
(global-set-key (kbd "<home>") 'beginning-of-line)
(global-set-key (kbd "<end>") 'end-of-line)
#+end_src

* save history
#+begin_src elisp
(savehist-mode 1)
(desktop-save-mode 1)
(recentf-mode 1)
#+end_src

* backup files
#+begin_src elisp
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
#+end_src

* org
#+begin_src elisp
(with-eval-after-load 'org
  (require 'org-tempo)
  (setq org-startup-indented t)
  (setq org-edit-src-content-indentation 0)
  (setq org-support-shift-select t)
  (add-to-list 'org-structure-template-alist '("el" . "src elisp"))
  (toggle-word-wrap 1)
  (toggle-truncate-lines 1)

  (defun insert-zero-width-space () (interactive) (insert-char #x200b))
  (defun my-latex-filter-zws (text backend info)
    (when (org-export-derived-backend-p backend 'latex)
      (replace-regexp-in-string "\x200B" "{}" text)))
  (global-set-key (kbd "C-*") 'insert-zero-width-space)

  (setq org-emphasis-alist
        '(("*" (bold :foreground "magenta"))
          ("/" (italic :foreground "cyan"))
          ("_" underline)
          ("=" org-verbatim verbatim)
          ("~" org-code verbatim)
          ("+" (:strike-through t)))
        )
  (setq org-hide-emphasis-markers t)
  (setq org-emphasis-regexp-components '("-[:multibyte:][:space:]('\"{" "-[:multibyte:][:space:].,:!?;'\")}\\[" "[:space:]" "." 1))
  (org-set-emph-re 'org-emphasis-regexp-components org-emphasis-regexp-components)
  (org-element-update-syntax)
  
  )
#+end_src

** org-roam
#+begin_src elisp
(use-package org-roam
  :straight t
  :init
  (setq org-roam-v2-ack t)
  (setq org-roam-db-update-on-save t)
  (org-roam-setup)
  :custom
  (org-roam-directory "~/SynologyDrive/zettelkasten/")
  (org-roam-completion-everywhere t)
  (org-roam-dailies-capture-templates
   '(("d" "default" entry "* %U %?" :if-new
  (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  :bind (("C-c n l" . org-roam-buffer-toggle)
         ("C-c n f" . org-roam-node-find)
         ("C-c n g" . org-roam-graph)
         ("C-c n i" . org-roam-node-insert)
         ("C-c n c" . org-roam-capture)
         ;; Dailies
         ("C-c n j" . org-roam-dailies-capture-today))
  :config
  (add-to-list 'display-buffer-alist
               '("\\*org-roam\\*"
		 (display-buffer-in-side-window)
		 (side . right)
		 (slot . 0)
		 (window-width . 0.33)
		 (window-parameters . ((no-other-window . t)
                                       (no-delete-other-windows . t)))))
  )
#+end_src

** org-roam-ui
#+begin_src elisp
(use-package org-roam-ui
  :straight (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t)
  )
#+end_src

** org-superstar
#+begin_src elisp
(use-package org-superstar
  :straight t
  :config
  (add-hook 'org-mode-hook (lambda() (org-superstar-mode 1)))
  )
#+end_src
* which-key
#+begin_src elisp
(use-package which-key
  :straight t
  :diminish
  :config
  (which-key-mode)
  (setq which-key-idle-delay 0)
  )
#+end_src

* company
#+begin_src elisp
(use-package company
  :straight t
  :config
  )
#+end_src
* magit
#+begin_src elisp
(use-package magit
  :straight t
  )
#+end_src

* exec-path-from-shell
#+begin_src elisp
(straight-use-package 'exec-path-from-shell)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+end_src

* vterm
#+begin_src elisp
(use-package vterm
  :straight t
  )
#+end_src


